Tekla Open API Reference for Tekla Structures 2025
PickerInputWithinAView.PickedView Property
 The view within which the pick occurred.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ViewBase PickedView { get; set; }
Public Property PickedView As ViewBase
	Get
	Set
Property Value
Type: ViewBase
See Also
Reference
PickerInputWithinAView Class
Tekla.Structures.Drawing Namespace